
 /*
*********************************************************************************************************
*	                                  
*	模块名称 :     
*	文件名称 : 
*	版    本 : V1.0
*	说    明 : 头文件
*
*********************************************************************************************************
*/

#ifndef  __GP8211S_H__
#define  __GP8211S_H__


#include "project.h"


//--------------------------------------------------------------------------
#define  DAC_CH_A	0x02
#define  DAC_CH_B	0x04
#define  DAC_CH_C	0x02
#define  DAC_CH_D	0x04


#define  DAC_POWER_ADD	0x01
#define  DAC_0_5V	    0x55
#define  DAC_0_10V	    0x77


#define  AXLE_NUM       2	//2轴=1PCS DAC  


//==============================================================================
uint8_t IIC_WriteGP8211S(uint16_t *wd,uint8_t chip);
uint8_t GP8211S_Power(uint8_t ov,uint8_t chip);







#endif

